## Staging: api
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 7 to add, 9 to change, 15 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                  NAME                                  |
|----------|------------------------------------------------------------------------|
| delete   | `module.vpc.aws_route_table_association.private[1]`                    |
|          | `module.vpc.aws_route_table_association.private[2]`                    |
|          | `module.vpc.aws_route_table_association.public[1]`                     |
|          | `module.vpc.aws_route_table_association.public[2]`                     |
|          | `module.vpc.aws_subnet.private[1]`                                     |
|          | `module.vpc.aws_subnet.private[2]`                                     |
|          | `module.vpc.aws_subnet.public[1]`                                      |
|          | `module.vpc.aws_subnet.public[2]`                                      |
| update   | `aws_vpc_endpoint.ecr_api`                                             |
|          | `aws_vpc_endpoint.ecr_dkr`                                             |
|          | `aws_vpc_endpoint.logs`                                                |
|          | `aws_vpc_endpoint.sns`                                                 |
|          | `aws_vpc_endpoint.sts`                                                 |
|          | `module.api.aws_lambda_function.this`                                  |
|          | `module.rds.aws_db_subnet_group.rds`                                   |
|          | `module.vpc.aws_network_acl.main`                                      |
|          | `module.vpc.aws_route.private_nat_gateway[0]`                          |
| recreate | `module.rds.aws_db_proxy.proxy`                                        |
|          | `module.rds.aws_secretsmanager_secret_version.proxy_connection_string` |
|          | `module.vpc.aws_nat_gateway.nat_gw[0]`                                 |
|          | `module.vpc.aws_route_table_association.private[0]`                    |
|          | `module.vpc.aws_route_table_association.public[0]`                     |
|          | `module.vpc.aws_subnet.private[0]`                                     |
|          | `module.vpc.aws_subnet.public[0]`                                      |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_vpc_endpoint.ecr_api will be updated in-place
  ~ resource "aws_vpc_endpoint" "ecr_api" {
        id                    = "vpce-0a25cd62c6c75d375"
      ~ subnet_ids            = [
          - "subnet-000542edc6d13c9b4",
          - "subnet-06884bda4c6fc4ae9",
          - "subnet-0aa6a088aae229401",
        ] -> (known after apply)
        tags                  = {}
        # (16 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_vpc_endpoint.ecr_dkr will be updated in-place
  ~ resource "aws_vpc_endpoint" "ecr_dkr" {
        id                    = "vpce-0ec2ca9257f5c279f"
      ~ subnet_ids            = [
          - "subnet-000542edc6d13c9b4",
          - "subnet-06884bda4c6fc4ae9",
          - "subnet-0aa6a088aae229401",
        ] -> (known after apply)
        tags                  = {}
        # (16 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_vpc_endpoint.logs will be updated in-place
  ~ resource "aws_vpc_endpoint" "logs" {
        id                    = "vpce-077ad10d553c961f4"
      ~ subnet_ids            = [
          - "subnet-000542edc6d13c9b4",
          - "subnet-06884bda4c6fc4ae9",
          - "subnet-0aa6a088aae229401",
        ] -> (known after apply)
        tags                  = {}
        # (16 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_vpc_endpoint.sns will be updated in-place
  ~ resource "aws_vpc_endpoint" "sns" {
        id                    = "vpce-0ef1c0fbb0b1cbbb1"
      ~ subnet_ids            = [
          - "subnet-000542edc6d13c9b4",
          - "subnet-06884bda4c6fc4ae9",
          - "subnet-0aa6a088aae229401",
        ] -> (known after apply)
        tags                  = {}
        # (16 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_vpc_endpoint.sts will be updated in-place
  ~ resource "aws_vpc_endpoint" "sts" {
        id                    = "vpce-0187f61ff7817caa8"
      ~ subnet_ids            = [
          - "subnet-000542edc6d13c9b4",
          - "subnet-06884bda4c6fc4ae9",
          - "subnet-0aa6a088aae229401",
        ] -> (known after apply)
        tags                  = {}
        # (16 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.api.aws_lambda_function.this will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      - code_signing_config_arn        = "" -> null
      - description                    = "" -> null
      - handler                        = "" -> null
        id                             = "scan-files-api"
      - kms_key_arn                    = "" -> null
      - runtime                        = "" -> null
      - signing_job_arn                = "" -> null
      - signing_profile_version_arn    = "" -> null
        tags                           = {
            "CostCentre" = "scan-files-staging"
            "Terraform"  = "true"
        }
        # (20 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "API_AUTH_TOKEN_SECRET_ARN"    = "arn:aws:secretsmanager:ca-central-1:127893201980:secret:/scan-files/api_auth_token-W7Y1XZ"
              - "AV_DEFINITION_S3_BUCKET"      = "scan-files-staging-clamav-defs"
              - "COMPLETED_SCANS_TABLE_NAME"   = "completed-scans"
              - "FILE_CHECKSUM_TABLE_NAME"     = "file-checksums"
              - "FILE_QUEUE_BUCKET"            = "scan-files-staging-file-queue"
              - "LOG_LEVEL"                    = "INFO"
              - "OPENAPI_URL"                  = "/openapi.json"
              - "POWERTOOLS_SERVICE_NAME"      = "scan-files-api"
              - "SCAN_QUEUE_STATEMACHINE_NAME" = "assemblyline-file-scan-queue"
              - "SQLALCHEMY_DATABASE_URI"      = (sensitive value)
            } -> (known after apply)
        }

      ~ vpc_config {
          ~ subnet_ids                  = [
              - "subnet-000542edc6d13c9b4",
              - "subnet-06884bda4c6fc4ae9",
              - "subnet-0aa6a088aae229401",
            ] -> (known after apply)
            # (3 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # module.rds.aws_db_proxy.proxy must be replaced
-/+ resource "aws_db_proxy" "proxy" {
      ~ arn                    = "arn:aws:rds:ca-central-1:127893201980:db-proxy:prx-045933f99d85c74c5" -> (known after apply)
      ~ endpoint               = "scan-files-proxy.proxy-cor4b5ll3day.ca-central-1.rds.amazonaws.com" -> (known after apply)
      ~ id                     = "scan-files-proxy" -> (known after apply)
        name                   = "scan-files-proxy"
        tags                   = {
            "CostCentre" = "scan-files-staging"
            "Name"       = "scan-files-rds-proxy"
            "Terraform"  = "true"
        }
      ~ vpc_subnet_ids         = [
          - "subnet-000542edc6d13c9b4",
          - "subnet-06884bda4c6fc4ae9",
          - "subnet-0aa6a088aae229401",
        ] -> (known after apply) # forces replacement
        # (7 unchanged attributes hidden)

      ~ auth {
          ~ client_password_auth_type = "POSTGRES_MD5" -> (known after apply)
            # (4 unchanged attributes hidden)
        }
    }

  # module.rds.aws_db_subnet_group.rds will be updated in-place
  ~ resource "aws_db_subnet_group" "rds" {
        id                      = "scan-files-subnet-group"
        name                    = "scan-files-subnet-group"
      ~ subnet_ids              = [
          - "subnet-000542edc6d13c9b4",
          - "subnet-06884bda4c6fc4ae9",
          - "subnet-0aa6a088aae229401",
        ] -> (known after apply)
        tags                    = {
            "CostCentre" = "scan-files-staging"
            "Name"       = "scan-files-subnet-group"
            "Terraform"  = "true"
        }
        # (5 unchanged attributes hidden)
    }

  # module.rds.aws_secretsmanager_secret_version.proxy_connection_string must be replaced
-/+ resource "aws_secretsmanager_secret_version" "proxy_connection_string" {
      ~ arn            = "arn:aws:secretsmanager:ca-central-1:127893201980:secret:scan-files-3crwk6-proxy-connection-string-u0HLhr" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:ca-central-1:127893201980:secret:scan-files-3crwk6-proxy-connection-string-u0HLhr|BD924A92-A885-487E-AFFE-CEFDE8E6C013" -> (known after apply)
      - secret_binary  = (sensitive value)
      ~ secret_string  = (sensitive value) # forces replacement
      ~ version_id     = "BD924A92-A885-487E-AFFE-CEFDE8E6C013" -> (known after apply)
      ~ version_stages = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.vpc.aws_nat_gateway.nat_gw[0] must be replaced
-/+ resource "aws_nat_gateway" "nat_gw" {
      ~ association_id                     = "eipassoc-0b1d11ecc978949c4" -> (known after apply)
      ~ id                                 = "nat-0e96c997187117f45" -> (known after apply)
      ~ network_interface_id               = "eni-0ad7e058d36d9412a" -> (known after apply)
      ~ private_ip                         = "10.0.3.87" -> (known after apply)
      ~ public_ip                          = "3.98.243.87" -> (known after apply)
      - secondary_allocation_ids           = [] -> null
      ~ secondary_private_ip_address_count = 0 -> (known after apply)
      ~ secondary_private_ip_addresses     = [] -> (known after apply)
      ~ subnet_id                          = "subnet-0bf254c63ab6def26" -> (known after apply) # forces replacement
        tags                               = {
            "CostCentre" = "scan-files-staging"
            "Name"       = "scan-files-natgw-0"
            "Terraform"  = "true"
        }
        # (3 unchanged attributes hidden)
    }

  # module.vpc.aws_network_acl.main will be updated in-place
  ~ resource "aws_network_acl" "main" {
        id         = "acl-00cc5570d2edcb127"
      ~ subnet_ids = [
          - "subnet-000542edc6d13c9b4",
          - "subnet-06884bda4c6fc4ae9",
          - "subnet-087830ff0ab1d7291",
          - "subnet-0aa6a088aae229401",
          - "subnet-0bf254c63ab6def26",
          - "subnet-0d5676fb6ff25aad6",
        ] -> (known after apply)
        tags       = {
            "CostCentre" = "scan-files-staging"
            "Name"       = "scan-files_main_nacl"
            "Terraform"  = "true"
        }
        # (6 unchanged attributes hidden)
    }

  # module.vpc.aws_route.private_nat_gateway[0] will be updated in-place
  ~ resource "aws_route" "private_nat_gateway" {
        id                     = "r-rtb-0590010e12f48b6701080289494"
      ~ nat_gateway_id         = "nat-0e96c997187117f45" -> (known after apply)
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vpc.aws_route_table_association.private[0] must be replaced
-/+ resource "aws_route_table_association" "private" {
      ~ id             = "rtbassoc-044e8a48151b4f298" -> (known after apply)
      ~ subnet_id      = "subnet-0aa6a088aae229401" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.vpc.aws_route_table_association.private[1] will be destroyed
  # (because index [1] is out of range for count)
  - resource "aws_route_table_association" "private" {
      - id             = "rtbassoc-0a70c98e6cf66c8a7" -> null
      - route_table_id = "rtb-0590010e12f48b670" -> null
      - subnet_id      = "subnet-000542edc6d13c9b4" -> null
    }

  # module.vpc.aws_route_table_association.private[2] will be destroyed
  # (because index [2] is out of range for count)
  - resource "aws_route_table_association" "private" {
      - id             = "rtbassoc-03247c88c699874a3" -> null
      - route_table_id = "rtb-0590010e12f48b670" -> null
      - subnet_id      = "subnet-06884bda4c6fc4ae9" -> null
    }

  # module.vpc.aws_route_table_association.public[0] must be replaced
-/+ resource "aws_route_table_association" "public" {
      ~ id             = "rtbassoc-0ca82d0bab5bf4681" -> (known after apply)
      ~ subnet_id      = "subnet-0bf254c63ab6def26" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.vpc.aws_route_table_association.public[1] will be destroyed
  # (because index [1] is out of range for count)
  - resource "aws_route_table_association" "public" {
      - id             = "rtbassoc-00c4db160d5f80495" -> null
      - route_table_id = "rtb-0e35b028c0f15361a" -> null
      - subnet_id      = "subnet-0d5676fb6ff25aad6" -> null
    }

  # module.vpc.aws_route_table_association.public[2] will be destroyed
  # (because index [2] is out of range for count)
  - resource "aws_route_table_association" "public" {
      - id             = "rtbassoc-067c0c6fa957b7cdb" -> null
      - route_table_id = "rtb-0e35b028c0f15361a" -> null
      - subnet_id      = "subnet-087830ff0ab1d7291" -> null
    }

  # module.vpc.aws_subnet.private[0] must be replaced
-/+ resource "aws_subnet" "private" {
      ~ arn                                            = "arn:aws:ec2:ca-central-1:127893201980:subnet/subnet-0aa6a088aae229401" -> (known after apply)
      ~ availability_zone_id                           = "cac1-az1" -> (known after apply)
      ~ cidr_block                                     = "10.0.0.0/24" -> "10.0.0.0/26" # forces replacement
      - enable_lni_at_device_index                     = 0 -> null
      ~ id                                             = "subnet-0aa6a088aae229401" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "127893201980" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
        tags                                           = {
            "CostCentre" = "scan-files-staging"
            "Name"       = "scan-files_private_subnet_ca-central-1a"
            "Terraform"  = "true"
            "Tier"       = "Private"
        }
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vpc.aws_subnet.private[1] will be destroyed
  # (because index [1] is out of range for count)
  - resource "aws_subnet" "private" {
      - arn                                            = "arn:aws:ec2:ca-central-1:127893201980:subnet/subnet-000542edc6d13c9b4" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "ca-central-1b" -> null
      - availability_zone_id                           = "cac1-az2" -> null
      - cidr_block                                     = "10.0.1.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-000542edc6d13c9b4" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "127893201980" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "CostCentre" = "scan-files-staging"
          - "Name"       = "scan-files_private_subnet_ca-central-1b"
          - "Terraform"  = "true"
          - "Tier"       = "Private"
        } -> null
      - tags_all                                       = {
          - "CostCentre" = "scan-files-staging"
          - "Name"       = "scan-files_private_subnet_ca-central-1b"
          - "Terraform"  = "true"
          - "Tier"       = "Private"
        } -> null
      - vpc_id                                         = "vpc-024adeef6279a5350" -> null

      - timeouts {
          - delete = "40m" -> null
        }
    }

  # module.vpc.aws_subnet.private[2] will be destroyed
  # (because index [2] is out of range for count)
  - resource "aws_subnet" "private" {
      - arn                                            = "arn:aws:ec2:ca-central-1:127893201980:subnet/subnet-06884bda4c6fc4ae9" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "ca-central-1d" -> null
      - availability_zone_id                           = "cac1-az4" -> null
      - cidr_block                                     = "10.0.2.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-06884bda4c6fc4ae9" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "127893201980" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "CostCentre" = "scan-files-staging"
          - "Name"       = "scan-files_private_subnet_ca-central-1d"
          - "Terraform"  = "true"
          - "Tier"       = "Private"
        } -> null
      - tags_all                                       = {
          - "CostCentre" = "scan-files-staging"
          - "Name"       = "scan-files_private_subnet_ca-central-1d"
          - "Terraform"  = "true"
          - "Tier"       = "Private"
        } -> null
      - vpc_id                                         = "vpc-024adeef6279a5350" -> null

      - timeouts {
          - delete = "40m" -> null
        }
    }

  # module.vpc.aws_subnet.public[0] must be replaced
-/+ resource "aws_subnet" "public" {
      ~ arn                                            = "arn:aws:ec2:ca-central-1:127893201980:subnet/subnet-0bf254c63ab6def26" -> (known after apply)
      ~ availability_zone_id                           = "cac1-az1" -> (known after apply)
      ~ cidr_block                                     = "10.0.3.0/24" -> "10.0.0.64/26" # forces replacement
      - enable_lni_at_device_index                     = 0 -> null
      ~ id                                             = "subnet-0bf254c63ab6def26" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "127893201980" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
        tags                                           = {
            "CostCentre" = "scan-files-staging"
            "Name"       = "scan-files_public_subnet_ca-central-1a"
            "Terraform"  = "true"
            "Tier"       = "Public"
        }
        # (9 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public[1] will be destroyed
  # (because index [1] is out of range for count)
  - resource "aws_subnet" "public" {
      - arn                                            = "arn:aws:ec2:ca-central-1:127893201980:subnet/subnet-0d5676fb6ff25aad6" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "ca-central-1b" -> null
      - availability_zone_id                           = "cac1-az2" -> null
      - cidr_block                                     = "10.0.4.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0d5676fb6ff25aad6" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "127893201980" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "CostCentre" = "scan-files-staging"
          - "Name"       = "scan-files_public_subnet_ca-central-1b"
          - "Terraform"  = "true"
          - "Tier"       = "Public"
        } -> null
      - tags_all                                       = {
          - "CostCentre" = "scan-files-staging"
          - "Name"       = "scan-files_public_subnet_ca-central-1b"
          - "Terraform"  = "true"
          - "Tier"       = "Public"
        } -> null
      - vpc_id                                         = "vpc-024adeef6279a5350" -> null
    }

  # module.vpc.aws_subnet.public[2] will be destroyed
  # (because index [2] is out of range for count)
  - resource "aws_subnet" "public" {
      - arn                                            = "arn:aws:ec2:ca-central-1:127893201980:subnet/subnet-087830ff0ab1d7291" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "ca-central-1d" -> null
      - availability_zone_id                           = "cac1-az4" -> null
      - cidr_block                                     = "10.0.5.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-087830ff0ab1d7291" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "127893201980" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "CostCentre" = "scan-files-staging"
          - "Name"       = "scan-files_public_subnet_ca-central-1d"
          - "Terraform"  = "true"
          - "Tier"       = "Public"
        } -> null
      - tags_all                                       = {
          - "CostCentre" = "scan-files-staging"
          - "Name"       = "scan-files_public_subnet_ca-central-1d"
          - "Terraform"  = "true"
          - "Tier"       = "Public"
        } -> null
      - vpc_id                                         = "vpc-024adeef6279a5350" -> null
    }

Plan: 7 to add, 9 to change, 15 to destroy.

Changes to Outputs:
  ~ private_subnet_ids = [
      - "subnet-0aa6a088aae229401",
      - "subnet-000542edc6d13c9b4",
      - "subnet-06884bda4c6fc4ae9",
      + (known after apply),
    ]

Warning: Argument is deprecated

  with module.clamav-defs.aws_s3_bucket.this,
  on .terraform/modules/clamav-defs/S3/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_logging resource instead

(and 10 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.ecr_api"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.ecr_dkr"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.s3"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.sns"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.sts"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_ip_set.ip_allowlist"]
WARN - plan.json - main - Missing Common Tags: ["module.resolver_dns.aws_route53_resolver_firewall_rule_group_association.firewall_rules[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.resolver_dns.aws_route53_resolver_query_log_config.route53_vpc_dns"]

28 tests, 19 passed, 9 warnings, 0 failures, 0 exceptions

```

</details>
